Revit 2027 API
PlanViewDirection Enumeration
 This enumerated type represents the possible directions for a plan view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PlanViewDirection
Public Enumeration PlanViewDirection
public enum class PlanViewDirection
type PlanViewDirection
Members
Member name | Value | Description
Down | 0 |  Revit looks down onto the plan view
Undefined | -1 |  View does not use Plan View Direction
Up | 1 |  Revit looks up to the plan view
See Also
Reference
Autodesk.Revit.DB Namespace